; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=80, out_folder=htg/blocksworld/training, instance_id=60, seed=2084

(define (problem blocksworld-60)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 - object)
 (:init 
    (arm-empty)
    (clear b1)
    (on b1 b45)
    (on b45 b53)
    (on b53 b29)
    (on b29 b39)
    (on-table b39)
    (clear b34)
    (on b34 b3)
    (on b3 b74)
    (on b74 b37)
    (on b37 b64)
    (on b64 b9)
    (on b9 b27)
    (on b27 b70)
    (on b70 b55)
    (on b55 b47)
    (on b47 b10)
    (on b10 b4)
    (on b4 b2)
    (on b2 b60)
    (on b60 b26)
    (on b26 b79)
    (on b79 b62)
    (on b62 b41)
    (on b41 b50)
    (on-table b50)
    (clear b7)
    (on b7 b54)
    (on b54 b12)
    (on b12 b22)
    (on b22 b71)
    (on b71 b58)
    (on b58 b8)
    (on b8 b46)
    (on b46 b11)
    (on b11 b65)
    (on b65 b49)
    (on b49 b15)
    (on b15 b30)
    (on b30 b5)
    (on b5 b32)
    (on b32 b40)
    (on b40 b33)
    (on b33 b13)
    (on-table b13)
    (clear b17)
    (on b17 b69)
    (on b69 b25)
    (on b25 b16)
    (on b16 b44)
    (on b44 b52)
    (on b52 b68)
    (on b68 b19)
    (on b19 b76)
    (on b76 b23)
    (on b23 b72)
    (on b72 b31)
    (on b31 b18)
    (on-table b18)
    (clear b66)
    (on b66 b57)
    (on b57 b80)
    (on b80 b59)
    (on b59 b73)
    (on-table b73)
    (clear b35)
    (on b35 b38)
    (on b38 b43)
    (on b43 b21)
    (on b21 b48)
    (on b48 b20)
    (on b20 b67)
    (on b67 b63)
    (on b63 b24)
    (on b24 b14)
    (on b14 b6)
    (on b6 b75)
    (on b75 b61)
    (on b61 b28)
    (on b28 b51)
    (on b51 b77)
    (on b77 b42)
    (on b42 b78)
    (on b78 b36)
    (on b36 b56)
    (on-table b56))
 (:goal  (and 
    (clear b2)
    (on b2 b3)
    (on b3 b6)
    (on b6 b4)
    (on b4 b7)
    (on b7 b5)
    (on b5 b1)
    (on b1 b8)
    (on-table b8))))

; plan
1. (unstack b34 b3)
   deleted: (on b34 b3) (clear b34) (arm-empty)
   added: (holding b34) (clear b3)
   goals met: 0 of 9
2. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 0 of 9
3. (unstack b35 b38)
   deleted: (on b35 b38) (clear b35) (arm-empty)
   added: (holding b35) (clear b38)
   goals met: 0 of 9
4. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 0 of 9
5. (unstack b38 b43)
   deleted: (on b38 b43) (clear b38) (arm-empty)
   added: (holding b38) (clear b43)
   goals met: 0 of 9
6. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 0 of 9
7. (unstack b43 b21)
   deleted: (on b43 b21) (clear b43) (arm-empty)
   added: (holding b43) (clear b21)
   goals met: 0 of 9
8. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 0 of 9
9. (unstack b21 b48)
   deleted: (on b21 b48) (clear b21) (arm-empty)
   added: (holding b21) (clear b48)
   goals met: 0 of 9
10. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 0 of 9
11. (unstack b48 b20)
   deleted: (on b48 b20) (clear b48) (arm-empty)
   added: (holding b48) (clear b20)
   goals met: 0 of 9
12. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 0 of 9
13. (unstack b20 b67)
   deleted: (on b20 b67) (clear b20) (arm-empty)
   added: (holding b20) (clear b67)
   goals met: 0 of 9
14. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 0 of 9
15. (unstack b67 b63)
   deleted: (on b67 b63) (clear b67) (arm-empty)
   added: (holding b67) (clear b63)
   goals met: 0 of 9
16. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 0 of 9
17. (unstack b63 b24)
   deleted: (on b63 b24) (clear b63) (arm-empty)
   added: (holding b63) (clear b24)
   goals met: 0 of 9
18. (putdown b63)
   deleted: (holding b63)
   added: (clear b63) (arm-empty) (on-table b63)
   goals met: 0 of 9
19. (unstack b24 b14)
   deleted: (on b24 b14) (clear b24) (arm-empty)
   added: (holding b24) (clear b14)
   goals met: 0 of 9
20. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 0 of 9
21. (unstack b14 b6)
   deleted: (on b14 b6) (clear b14) (arm-empty)
   added: (holding b14) (clear b6)
   goals met: 0 of 9
22. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 0 of 9
23. (unstack b3 b74)
   deleted: (on b3 b74) (clear b3) (arm-empty)
   added: (holding b3) (clear b74)
   goals met: 0 of 9
24. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 1 of 9
25. (unstack b74 b37)
   deleted: (on b74 b37) (clear b74) (arm-empty)
   added: (holding b74) (clear b37)
   goals met: 1 of 9
26. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 1 of 9
27. (unstack b37 b64)
   deleted: (on b37 b64) (clear b37) (arm-empty)
   added: (holding b37) (clear b64)
   goals met: 1 of 9
28. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 1 of 9
29. (unstack b64 b9)
   deleted: (on b64 b9) (clear b64) (arm-empty)
   added: (holding b64) (clear b9)
   goals met: 1 of 9
30. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 1 of 9
31. (unstack b9 b27)
   deleted: (on b9 b27) (clear b9) (arm-empty)
   added: (holding b9) (clear b27)
   goals met: 1 of 9
32. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 9
33. (unstack b27 b70)
   deleted: (on b27 b70) (clear b27) (arm-empty)
   added: (holding b27) (clear b70)
   goals met: 1 of 9
34. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 1 of 9
35. (unstack b70 b55)
   deleted: (on b70 b55) (clear b70) (arm-empty)
   added: (holding b70) (clear b55)
   goals met: 1 of 9
36. (putdown b70)
   deleted: (holding b70)
   added: (clear b70) (arm-empty) (on-table b70)
   goals met: 1 of 9
37. (unstack b55 b47)
   deleted: (on b55 b47) (clear b55) (arm-empty)
   added: (holding b55) (clear b47)
   goals met: 1 of 9
38. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 1 of 9
39. (unstack b47 b10)
   deleted: (on b47 b10) (clear b47) (arm-empty)
   added: (holding b47) (clear b10)
   goals met: 1 of 9
40. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 1 of 9
41. (unstack b10 b4)
   deleted: (on b10 b4) (clear b10) (arm-empty)
   added: (holding b10) (clear b4)
   goals met: 1 of 9
42. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 1 of 9
43. (unstack b4 b2)
   deleted: (on b4 b2) (clear b4) (arm-empty)
   added: (holding b4) (clear b2)
   goals met: 2 of 9
44. (stack b4 b7)
   deleted: (clear b7) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b7)
   goals met: 3 of 9
45. (unstack b2 b60)
   deleted: (on b2 b60) (clear b2) (arm-empty)
   added: (holding b2) (clear b60)
   goals met: 2 of 9
46. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 4 of 9
47. (unstack b4 b7)
   deleted: (on b4 b7) (clear b4) (arm-empty)
   added: (holding b4) (clear b7)
   goals met: 3 of 9
48. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 3 of 9
49. (unstack b7 b54)
   deleted: (on b7 b54) (clear b7) (arm-empty)
   added: (holding b7) (clear b54)
   goals met: 3 of 9
50. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 3 of 9
51. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 3 of 9
52. (stack b4 b7)
   deleted: (clear b7) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b7)
   goals met: 4 of 9
53. (unstack b54 b12)
   deleted: (on b54 b12) (clear b54) (arm-empty)
   added: (holding b54) (clear b12)
   goals met: 4 of 9
54. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 4 of 9
55. (unstack b12 b22)
   deleted: (on b12 b22) (clear b12) (arm-empty)
   added: (holding b12) (clear b22)
   goals met: 4 of 9
56. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 4 of 9
57. (unstack b22 b71)
   deleted: (on b22 b71) (clear b22) (arm-empty)
   added: (holding b22) (clear b71)
   goals met: 4 of 9
58. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 4 of 9
59. (unstack b71 b58)
   deleted: (on b71 b58) (clear b71) (arm-empty)
   added: (holding b71) (clear b58)
   goals met: 4 of 9
60. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 4 of 9
61. (unstack b58 b8)
   deleted: (on b58 b8) (clear b58) (arm-empty)
   added: (holding b58) (clear b8)
   goals met: 4 of 9
62. (putdown b58)
   deleted: (holding b58)
   added: (clear b58) (arm-empty) (on-table b58)
   goals met: 4 of 9
63. (unstack b8 b46)
   deleted: (on b8 b46) (clear b8) (arm-empty)
   added: (holding b8) (clear b46)
   goals met: 4 of 9
64. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 5 of 9
65. (unstack b1 b45)
   deleted: (on b1 b45) (clear b1) (arm-empty)
   added: (holding b1) (clear b45)
   goals met: 5 of 9
66. (stack b1 b8)
   deleted: (clear b8) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b8)
   goals met: 6 of 9
67. (unstack b46 b11)
   deleted: (on b46 b11) (clear b46) (arm-empty)
   added: (holding b46) (clear b11)
   goals met: 6 of 9
68. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 6 of 9
69. (unstack b11 b65)
   deleted: (on b11 b65) (clear b11) (arm-empty)
   added: (holding b11) (clear b65)
   goals met: 6 of 9
70. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 6 of 9
71. (unstack b65 b49)
   deleted: (on b65 b49) (clear b65) (arm-empty)
   added: (holding b65) (clear b49)
   goals met: 6 of 9
72. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 6 of 9
73. (unstack b49 b15)
   deleted: (on b49 b15) (clear b49) (arm-empty)
   added: (holding b49) (clear b15)
   goals met: 6 of 9
74. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 6 of 9
75. (unstack b15 b30)
   deleted: (on b15 b30) (clear b15) (arm-empty)
   added: (holding b15) (clear b30)
   goals met: 6 of 9
76. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 6 of 9
77. (unstack b30 b5)
   deleted: (on b30 b5) (clear b30) (arm-empty)
   added: (holding b30) (clear b5)
   goals met: 6 of 9
78. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 6 of 9
79. (unstack b5 b32)
   deleted: (on b5 b32) (clear b5) (arm-empty)
   added: (holding b5) (clear b32)
   goals met: 6 of 9
80. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 7 of 9
81. (unstack b4 b7)
   deleted: (on b4 b7) (clear b4) (arm-empty)
   added: (holding b4) (clear b7)
   goals met: 6 of 9
82. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 6 of 9
83. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 6 of 9
84. (stack b7 b5)
   deleted: (clear b5) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b5)
   goals met: 7 of 9
85. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 7 of 9
86. (stack b4 b7)
   deleted: (clear b7) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b7)
   goals met: 8 of 9
87. (unstack b2 b3)
   deleted: (on b2 b3) (clear b2) (arm-empty)
   added: (holding b2) (clear b3)
   goals met: 6 of 9
88. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 7 of 9
89. (unstack b3 b6)
   deleted: (on b3 b6) (clear b3) (arm-empty)
   added: (holding b3) (clear b6)
   goals met: 6 of 9
90. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 6 of 9
91. (unstack b6 b75)
   deleted: (on b6 b75) (clear b6) (arm-empty)
   added: (holding b6) (clear b75)
   goals met: 6 of 9
92. (stack b6 b4)
   deleted: (clear b4) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b4)
   goals met: 7 of 9
93. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 7 of 9
94. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 8 of 9
95. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 7 of 9
96. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 9 of 9
